app/views/painel/sales/new.html.erb

            <%= f.label :payment_id, "Forma de Pagamento" , class: "control-label form-label" %>
            <%= collection_select(:sale, :payment_id, Payment.all, :id, :name, { :prompt => "Selecione uma forma de pagamento" }, { :class=>'form-control'}) %>
---
SELECT "payments".* FROM "payments"

            <%= f.label :client_id, "Cliente" , class: "control-label form-label" %>
            <%= collection_select(:sale, :client_id, Client.all, :id, :name, { :prompt => "Selecione um cliente" }, { :class=>'form-control'}) %>
---
SELECT "clients".* FROM "clients"