app/controllers/painel/clients_controller.rb

INSERT INTO "clients" ("name", "telephone", "cellphone", "email", "CEP", "address_line", "number", "district", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)
    respond_to do |f|
      if @client.save