app/controllers/painel/sales_controller.rb

  def index
    @sales = Sale.all
---
SELECT "sales".* FROM "sales"

  def create
    @sale = Sale.new(sale_params)
    @sale.employee_id = current_user.id
    respond_to do |f|
      if @sale.save
---
INSERT INTO "sales" ("payment_id", "client_id", "price", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["payment_id", 1], ["client_id", 1], ["price", 20.0], ["employee_id", 1], ["created_at", "2016-03-29 21:26:04.552415"], ["updated_at", "2016-03-29 21:26:04.552415"]]